app/Controllers/Checkout.php


        $bairroRetornoSlug = mb_url_title($consulta->bairro, '-', true);

        $bairro = $this->bairroModel->select('nome, valor_entrega, slug')->where('slug', $bairroRetornoSlug)->where('ativo', true)->first();
---
SELECT `nome`, `valor_entrega`, `slug`
FROM `bairros`
WHERE `slug` = 'vila-industrial'
AND `ativo` = 1
AND `bairros`.`deletado_em` IS NULL
 LIMIT 1


            }

            $bairro = $this->bairroModel->where('slug', $checkoutPost['bairro_slug'])->where('ativo', true)->first();
---
SELECT *
FROM `bairros`
WHERE `slug` = 'vila-industrial'
AND `ativo` = 1
AND `bairros`.`deletado_em` IS NULL
 LIMIT 1